cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51P20A.svd
               <register>
                  <name>INTENCLR</name>
                  <description>SPIS Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>SPIS Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>SPIS Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>SPIS Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BUFOVF</name>
                        <description>Buffer Overflow</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENERR</name>
                        <description>Transaction Length Error</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>SPIS Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENGTH</name>
                        <description>LENGTH Synchronization Busy</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LENGTH</name>
                  <description>SPIS Length</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LEN</name>
                        <description>Data Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>LENEN</name>
                        <description>Data Length Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR</name>
                  <description>SPIS Address</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>ADDRMASK</name>
                        <description>Address Mask</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>SPIS Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>SPIS Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>SPIM</name>
               <description>SPI Master Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomSpim</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>SPIM Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT_CLK</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT_CLK</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C master operation</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run during Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IBON</name>
                        <description>Immediate Buffer Overflow Notification</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DOPO</name>
                        <description>Data Out Pinout</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DOPOSelect</name>
                           <enumeratedValue>
                              <name>PAD0</name>
                              <description>DO on PAD[0], SCK on PAD[1] and SS on PAD[2]</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD2</name>
                              <description>DO on PAD[3], SCK on PAD[1] and SS on PAD[2]</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIPO</name>
                        <description>Data In Pinout</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DIPOSelect</name>
                           <enumeratedValue>
                              <name>PAD0</name>
                              <description>SERCOM PAD[0] is used as data input</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD1</name>
                              <description>SERCOM PAD[1] is used as data input</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD2</name>
                              <description>SERCOM PAD[2] is used as data input</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD3</name>
                              <description>SERCOM PAD[3] is used as data input</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FORM</name>
                        <description>Frame Format</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>FORMSelect</name>
                           <enumeratedValue>
                              <name>SPI_FRAME</name>
                              <description>SPI Frame</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_FRAME_WITH_ADDR</name>
                              <description>SPI Frame with Addr</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPHA</name>
                        <description>Clock Phase</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CPHASelect</name>
                           <enumeratedValue>
                              <name>LEADING_EDGE</name>
                              <description>The data is sampled on a leading SCK edge and changed on a trailing SCK edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRAILING_EDGE</name>
                              <description>The data is sampled on a trailing SCK edge and changed on a leading SCK edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Clock Polarity</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CPOLSelect</name>
                           <enumeratedValue>
                              <name>IDLE_LOW</name>
                              <description>SCK is low when idle</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IDLE_HIGH</name>
                              <description>SCK is high when idle</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DORD</name>
                        <description>Data Order</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DORDSelect</name>
                           <enumeratedValue>
                              <name>MSB</name>
                              <description>MSB is transferred first</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LSB</name>
                              <description>LSB is transferred first</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
